In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([1,2,3,4,5])

In [3]:
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data.values

array([1, 2, 3, 4, 5])

In [5]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
data[0]

1

In [7]:
data[1:3]

1    2
2    3
dtype: int64

In [8]:
data = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

In [9]:
data['c']

3

In [10]:
data = pd.Series({'a':1, 'b':2, 'c':3, 'd':4, 'e':5})

In [11]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
data[a]

NameError: name 'a' is not defined

In [13]:
data['b':'d']

b    2
c    3
d    4
dtype: int64

In [14]:
data['d']

4

In [15]:
series_1 = pd.Series(dict(a=1, b=2, c=3, d=4, e=5))

In [16]:
series_2 = pd.Series(dict(a=11, b=12, c=13, d=14, e=15))

In [17]:
df = pd.DataFrame({'column_1':series_1, 'column_2':series_2})

In [18]:
df

   column_1  column_2
a         1        11
b         2        12
c         3        13
d         4        14
e         5        15

In [19]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [20]:
df.columns

Index(['column_1', 'column_2'], dtype='object')

In [21]:
pd.DataFrame([[行の配列1],[行の配列2]…], index=[行の名前], columns=[列の名前])

SyntaxError: invalid character '…' (U+2026) (3739832718.py, line 1)

In [22]:
df2 = pd.DataFrame([[1,2],[11,12], [21, 22]], index=['a', 'b', 'c'], columns=['col_1', 'col_2'])

In [23]:
df2

   col_1  col_2
a      1      2
b     11     12
c     21     22

In [25]:
df2 = pd.DataFrame([[1,2,3],[11,12,13], [21, 22,23]], index=['a', 'b','c'], columns=['col_1', 'col_2','col_3'])

In [26]:
df2

   col_1  col_2  col_3
a      1      2      3
b     11     12     13
c     21     22     23

In [27]:
df.at['a', 'column_1']

1

In [28]:
df

   column_1  column_2
a         1        11
b         2        12
c         3        13
d         4        14
e         5        15

In [29]:
df.at['b', 'column_2'] = 100

In [30]:
df

   column_1  column_2
a         1        11
b         2       100
c         3        13
d         4        14
e         5        15

In [31]:
df.iat[3, 1] = 1000

In [32]:
df

   column_1  column_2
a         1        11
b         2       100
c         3        13
d         4      1000
e         5        15

In [33]:
df.loc['a','column_1'] = 3.1

In [34]:
df

   column_1  column_2
a       3.1        11
b       2.0       100
c       3.0        13
d       4.0      1000
e       5.0        15

In [35]:
df.to_csv('df_data.csv')

In [36]:
df2.to_excel('df2_data.xlsx')

In [37]:
df3 = pd.read_csv('df_data.csv')

In [38]:
df4 = pd.read_excel('df2_data.xlsx')

In [39]:
df3

  Unnamed: 0  column_1  column_2
0          a       3.1        11
1          b       2.0       100
2          c       3.0        13
3          d       4.0      1000
4          e       5.0        15

In [40]:
df4

  Unnamed: 0  col_1  col_2  col_3
0          a      1      2      3
1          b     11     12     13
2          c     21     22     23